package ex02_class;

public class Car {
	// 필드는 각 객체가 갖는 변수 .
	//int wheel ;// 필드의 선언 
	
	int wheel = 4 ; // 필드를 초기화 하는것도 가능하다 .

	//메서드의 정의
	void ride() {
		System.out.println("달립니다");
	}

	//기본생성자
	// 정의를 하지않으면 컴파일러가 알아서 정의해준다
	//클래스명(){
	//
	//}
	
	Car(){
		
	}
	// 생성자를 통해 객체 변수를 초기화한다는 말을 , 필드와 메서드를 호출할 수 있는 
	// 객체를 사용하기위해 객체 변수가 메모리에 올라가야 하는데, 메모리에 객체를 
	// 올려주는 역할을 한다 . //	new가 메모리에 공간할당을받고 
						//  Car() 생성자가 할당받은곳에 객체를 올린다 
						// ※생성자가 객체에 메모리를 올려주는 역할을한다 





}
